# Pandas Library - For Tabular Data

Most Microsoft Excel functions can be performed with this library.

In [ ]:
#pip install pandas

In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
#Importing the library pandas as pd so that it is easy to use it as prefix before the pandas functions
import pandas as pd

In [3]:
#Reading a .csv file
#CSV - Comma Separated Values
pd.read_csv("https://raw.githubusercontent.com/Apress/data-analysis-and-visualization-using-python/master/Ch07/Salaries.csv")

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [4]:
#Importing the data on the web in a csv file into a dataframe in Anaconda environment
df = pd.read_csv("https://raw.githubusercontent.com/Apress/data-analysis-and-visualization-using-python/master/Ch07/Salaries.csv")

In [5]:
#Displaying the contents of a dataframe
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [6]:
import os
os.getcwd()

'C:\\Users\\Neha Excelr\\ExcelR Content'

In [7]:
os.chdir('C:\\Users\\Neha Excelr\\DataSets')
os.getcwd()

'C:\\Users\\Neha Excelr\\DataSets'

In [8]:
mtcars=pd.read_csv('mtcars.csv')
mtcars

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0   21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3   21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4   18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
5   18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
6   14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4
7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
9   19.2    6  167.6  123  3.92  3.440  18.30   1   0     4     4
10  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4     4
11  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3     3
12  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3     3
13  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3     3
14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4
15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4
16  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3     4
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3     1
21  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3     2
22  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3     2
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4
24  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3     2
25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
28  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5     4
29  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5     6
30  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5     8
31  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2

In [43]:
os.chdir('C:\\Users\\USER\\ExcelR Content')
os.getcwd()

FileNotFoundError: [WinError 3] The system cannot find the path specified: 'C:\\Users\\USER\\ExcelR Content'

In [ ]:
mtcars=pd.read_csv('mtcars.csv')
mtcars

In [ ]:
#Import a CSV (Comma Separated Values) file in Python 
cars=pd.read_csv("C:\\Users\\Neha Excelr\\DataSets\\mtcars.csv")
cars

In [ ]:
#'Head' displays the first 5 rows. Default setting in head function is to display 5 rows.
df.head()

In [10]:
#'head(10)' displays the first 10 rows. 
# We can change this number, to display the required number of rows.  
df.head(12)

         rank discipline  phd  service   sex  salary
0        Prof          B   56       49  Male  186960
1        Prof          A   12        6  Male   93000
2        Prof          A   23       20  Male  110515
3        Prof          A   40       31  Male  131205
4        Prof          B   20       18  Male  104800
5        Prof          A   20       20  Male  122400
6   AssocProf          A   20       17  Male   81285
7        Prof          A   18       18  Male  126300
8        Prof          A   29       19  Male   94350
9        Prof          A   51       51  Male   57800
10       Prof          B   39       33  Male  128250
11       Prof          B   23       23  Male  134778

In [11]:
#To display the last 5 rows of the data.
#Default setting in tail function is also to display 5 rows.
df.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [12]:
#'tail(8)' displays the last 8 rows. 
df.tail(8)

         rank discipline  phd  service     sex  salary
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [13]:
#To display the column names in a dataframe
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [14]:
#To create a list of the column names
col=list(df.columns)
col

['rank', 'discipline', 'phd', 'service', 'sex', 'salary']

In [15]:
#To display the data types of columns in a dataframe
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [16]:
#To generate summary statistics
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [17]:
df.describe(include='object')

        rank discipline   sex
count     78         78    78
unique     3          2     2
top     Prof          B  Male
freq      46         42    39

In [18]:
df.describe(include='int64')

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [19]:
df.describe(include='all')

        rank discipline        phd    service   sex         salary
count     78         78  78.000000  78.000000    78      78.000000
unique     3          2        NaN        NaN     2            NaN
top     Prof          B        NaN        NaN  Male            NaN
freq      46         42        NaN        NaN    39            NaN
mean     NaN        NaN  19.705128  15.051282   NaN  108023.782051
std      NaN        NaN  12.498425  12.139768   NaN   28293.661022
min      NaN        NaN   1.000000   0.000000   NaN   57800.000000
25%      NaN        NaN  10.250000   5.250000   NaN   88612.500000
50%      NaN        NaN  18.500000  14.500000   NaN  104671.000000
75%      NaN        NaN  27.750000  20.750000   NaN  126774.750000
max      NaN        NaN  56.000000  51.000000   NaN  186960.000000

In [20]:
#To generate summary statistics of a specific column 
df['phd'].describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [22]:
df[['phd','service','salary']].describe()

             phd    service
count  78.000000  78.000000
mean   19.705128  15.051282
std    12.498425  12.139768
min     1.000000   0.000000
25%    10.250000   5.250000
50%    18.500000  14.500000
75%    27.750000  20.750000
max    56.000000  51.000000

In [25]:
df[{'phd','service','salary'}].describe()

              salary        phd    service
count      78.000000  78.000000  78.000000
mean   108023.782051  19.705128  15.051282
std     28293.661022  12.498425  12.139768
min     57800.000000   1.000000   0.000000
25%     88612.500000  10.250000   5.250000
50%    104671.000000  18.500000  14.500000
75%    126774.750000  27.750000  20.750000
max    186960.000000  56.000000  51.000000

In [26]:
df['phd'].mean()

19.705128205128204

In [27]:
df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [28]:
df['phd'].max()

56

In [29]:
df.quantile(0.25)

phd           10.25
service        5.25
salary     88612.50
Name: 0.25, dtype: float64

In [30]:
df.median()

phd            18.5
service        14.5
salary     104671.0
dtype: float64

In [31]:
df['sex'].value_counts()

Male      39
Female    39
Name: sex, dtype: int64

In [32]:
df['rank'].value_counts()

Prof         46
AsstProf     19
AssocProf    13
Name: rank, dtype: int64

In [39]:
df[['sex','rank','discipline']].value_counts()

sex     rank       discipline
Male    Prof       A             15
                   B             13
Female  Prof       B             10
                   A              8
        AssocProf  B              6
        AsstProf   A              6
Male    AsstProf   B              6
Female  AsstProf   B              5
        AssocProf  A              4
Male    AssocProf  B              2
        AsstProf   A              2
        AssocProf  A              1
dtype: int64

In [38]:
df[['sex','rank','discipline','phd']].value_counts()

sex     rank       discipline  phd
Male    AsstProf   B           4      3
Female  Prof       B           17     3
Male    Prof       A           29     2
                   B           35     2
Female  AssocProf  B           12     2
                                     ..
        Prof       B           23     1
                               24     1
                               25     1
                               36     1
Male    Prof       B           56     1
Length: 68, dtype: int64

In [40]:
df[['sex' ,'rank','phd','salary']].value_counts()

sex     rank       phd  salary
Male    AsstProf   4    92000     2
Female  AssocProf  10   77500     1
Male    Prof       12   93000     1
                   20   122400    1
                        104800    1
                                 ..
Female  Prof       17   124312    1
                        122960    1
                        111512    1
                        90450     1
Male    Prof       56   186960    1
Length: 77, dtype: int64

In [34]:
df[['phd','service']].mean()

phd        19.705128
service    15.051282
dtype: float64

In [41]:
#To get the basic summary statistics of numerical variables
df_summary=df.describe()
print("Type of the structure of df_summary is", type(df_summary))
df_summary

Type of the structure of df_summary is <class 'pandas.core.frame.DataFrame'>

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [42]:
df_summary.to_csv('C:\\Users\\Neha Excelr\\DataSets\\df_summary.csv')

In [44]:
df.mode()

   rank discipline  phd  service     sex   salary
0  Prof          B  4.0      3.0  Female  92000.0
1   NaN        NaN  NaN      NaN    Male      NaN

In [45]:
#shape function will give the dimensions of the data (rows,columns)
df.shape

(78, 6)

In [46]:
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [47]:
df.iloc[[5,9,10,16,18,20],:]

        rank discipline  phd  service   sex  salary
5       Prof          A   20       20  Male  122400
9       Prof          A   51       51  Male   57800
10      Prof          B   39       33  Male  128250
16  AsstProf          B    8        3  Male   75044
18      Prof          A   19        7  Male  107300
20  AsstProf          B    4        4  Male   92000

In [48]:
df.iloc[:,[0,3,5]]

         rank  service  salary
0        Prof       49  186960
1        Prof        6   93000
2        Prof       20  110515
3        Prof       31  131205
4        Prof       18  104800
..        ...      ...     ...
73       Prof       10  105450
74  AssocProf        6  104542
75       Prof       17  124312
76       Prof       14  109954
77       Prof       15  109646

[78 rows x 3 columns]

In [49]:
df.iloc[[5,9,10,16,18,20],[0,3,5]]

        rank  service  salary
5       Prof       20  122400
9       Prof       51   57800
10      Prof       33  128250
16  AsstProf        3   75044
18      Prof        7  107300
20  AsstProf        4   92000

In [50]:
df.loc[[5,9,10,16,18,20],['rank','service','salary']]

        rank  service  salary
5       Prof       20  122400
9       Prof       51   57800
10      Prof       33  128250
16  AsstProf        3   75044
18      Prof        7  107300
20  AsstProf        4   92000

In [ ]:
df_summary.iloc[[4,5,6],:]

In [ ]:
df_summary.iloc[[4,5,6],[0,2]]

In [ ]:
df_summary.iloc[:,[0,1]]

In [ ]:
df_summary.loc[['25%','50%','75%'],['phd','service']]

In [ ]:
df_summary.iloc[[3,7],[0,2]]

In [ ]:
df_summary.loc[['min','max'],['phd','salary']]

In [ ]:
df['phd'].quantile(0.50)

In [ ]:
df_summary.loc[['min','max','count'],['phd','service']]

In [ ]:
df

In [ ]:
df.iloc[25:31,:]

In [ ]:
df.iloc[[1,5,9,4,7,8,3],:]

In [ ]:
df.iloc[25:31,1:4]

In [ ]:
#This will give the median by sorting the summary statistic values, saved in the dataframe, so this median will not be useful
#df_describe.median()    

#To get the true median, enter the code below.
print(df.median())

#Median is the same as 50%
print(df.quantile(0.5))

In [ ]:
#To get the maximum/highest value in numerical columns
df.max()

In [ ]:
df['rank'].unique()

In [ ]:
x = ['rank', 'discipline', 'phd', 'service', 'sex', 'salary']
for i in x:
    result = df[i].unique()
    rank = []
    for i in result:
        rank.append(i)
    print(result)

In [ ]:
for i in df:
     print(df[i].unique())

In [ ]:
x = df.columns
for i in x:
    result = df[i].unique()
    rank = []
    dict1 = {}
    for j in result:
        rank.append(j)
        dict1[i] = result
    print(dict1)
    print(result)

In [ ]:
x = df.columns
for i in x:
    result = df[i].unique()
    rank = []
    dict1 = {}
    for j in result:
        rank.append(j)
        dict1[i] = list(result)
    print(dict1)

In [ ]:
x = df.columns
for i in x:
    result = df[i].unique()
    rank = []
    dict1 = {}
    for j in result:
        rank.append(j)
        dict1[i] = list(sorted(result))
    print(dict1)

In [ ]:
#A,B,C,D.....X,Y,Z..a,b,c,....x,y,z
sorted_unique=[]
for i in df.columns:
    sorted_unique.append(list(df[i].unique()))

sorted_unique
for i in sorted_unique:
    i.sort(reverse=False)

sorted_unique

In [ ]:
#To find quartiles, deciles, percentiles
df.quantile(0.25)
#The lowest 25% values in phd will be EITHER LESSER THAN OR EQUAL TO 10.25
#The lowest 25% values in service will be EITHER LESSER THAN OR EQUAL TO 5.25
#The lowest 25% values in salary will be EITHER LESSER THAN OR EQUAL TO 88612.50

In [ ]:
df.quantile(0.30)

In [ ]:
df['service'].mean()

In [ ]:
round(df['service'].mean(),2)

In [ ]:
df[['rank','discipline','sex']].value_counts()

In [ ]:
#To get the frequency count of each unique value in the 'discipline' variable of 'df' dataframe
df['discipline'].value_counts()

In [ ]:
#To get the frequency count of each unique value in the 'rank' variable of 'df' dataframe
df['rank'].value_counts()

In [ ]:
#To get the standard deviation of all numerical variables in 'df' dataframe
df.std()

In [ ]:
#The code below will store the first 50 rows of the 'df' dataframe in a new dataframe 'df_50'
df_50=df.head(50)

In [ ]:
df_50

In [ ]:
#To get the average values of numerical variables in the 'df_50' dataframe
df_50.mean()

In [ ]:
df.head(50).mean()

In [ ]:
#Selecting the column 'salary'
df['salary']

In [ ]:
#Selecting multiple columns from a dataframe.
#For selecting multiple columns, the column names must be specified in a list (box bracket)
df[['salary','phd','service']]

In [ ]:
print(df['salary'].head())
print(df[['salary','phd','service']].head())

In [ ]:
df[['salary','service']].min()

Calculate the basic statistics for the Phd column;

Find how many values in the Phd column (use count method);

Calculate the average Phd;

In [ ]:
#To generate summary statistics of the 'PhD' column
df['phd'].describe()

In [ ]:
#To get the count of non-missing values in the 'PhD' variable
df['phd'].count()

In [ ]:
#To get the mean of values in the 'PhD' variable
df['phd'].mean()

In [ ]:
df

In [ ]:
a=[1,2,3,4,5]
b=[0,2,-1]
import operator
operator.itemgetter(*b)(a)

In [ ]:
df.median()

In [ ]:
df.mode()

In [ ]:
print(df['rank'].unique())

In [ ]:
df[['rank','phd']].value_counts()

In [51]:
#To get the average of numerical variables grouped by the values of 'rank' variable
df.groupby('rank').mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [52]:
df.groupby('rank')['salary'].mean()

rank
AssocProf     91786.230769
AsstProf      81362.789474
Prof         123624.804348
Name: salary, dtype: float64

In [53]:
df.groupby(['rank','discipline'])['salary'].mean()

rank       discipline
AssocProf  A              73959.800000
           B             102927.750000
AsstProf   A              74450.000000
           B              86390.272727
Prof       A             111935.695652
           B             135313.913043
Name: salary, dtype: float64

In [54]:
df.groupby(['rank','sex'])['salary'].max()

rank       sex
AssocProf  Female    109650
           Male      119800
AsstProf   Female     97032
           Male       92000
Prof       Female    161101
           Male      186960
Name: salary, dtype: int64

In [ ]:
df.groupby(['discipline']).mean()

In [ ]:
#To get the average of 'salary' variable grouped by the values of 'rank' variable
df.groupby('rank')['salary'].mean()

In [ ]:
df.groupby(['rank','discipline']).mean()

In [ ]:
df.groupby(['rank','discipline'])['salary'].mean()

In [ ]:
df.groupby('sex')['salary'].mean()

In [ ]:
df.groupby('sex').mean()

In [ ]:
df.groupby(['rank','discipline']).count()

In [ ]:
df.groupby('rank')['discipline'].value_counts()

In [55]:
df['rank']=='AssocProf'

0     False
1     False
2     False
3     False
4     False
      ...
73    False
74     True
75    False
76    False
77    False
Name: rank, Length: 78, dtype: bool

In [58]:
df[df['rank']=='AssocProf']

         rank discipline  phd  service     sex  salary
6   AssocProf          A   20       17    Male   81285
30  AssocProf          B    9        7    Male  107008
34  AssocProf          B   12        8    Male  119800
41  AssocProf          A   13        8  Female   74830
47  AssocProf          B   11       11  Female  103613
54  AssocProf          A   25       22  Female   62884
56  AssocProf          A   10        8  Female   77500
59  AssocProf          B   12       10  Female  103994
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
64  AssocProf          A   26       24  Female   73300
71  AssocProf          B   12        9  Female   71065
74  AssocProf          B   19        6  Female  104542

In [57]:
len(df[df['rank']=='AssocProf'])

13

In [59]:
df[(df['rank']=='AssocProf') & (df['discipline']=='A')]

         rank discipline  phd  service     sex  salary
6   AssocProf          A   20       17    Male   81285
41  AssocProf          A   13        8  Female   74830
54  AssocProf          A   25       22  Female   62884
56  AssocProf          A   10        8  Female   77500
64  AssocProf          A   26       24  Female   73300

In [60]:
#Rows that have 'AsstProf' & rows that have 'AssocProf' for the 'rank' column
df[(df['rank']=='AssocProf') | (df['rank']=='AsstProf')]

         rank discipline  phd  service     sex  salary
6   AssocProf          A   20       17    Male   81285
12   AsstProf          B    1        0    Male   88000
16   AsstProf          B    8        3    Male   75044
17   AsstProf          B    4        0    Male   92000
20   AsstProf          B    4        4    Male   92000
22   AsstProf          A    4        2    Male   73000
23   AsstProf          A    2        0    Male   85000
28   AsstProf          B    7        2    Male   91300
30  AssocProf          B    9        7    Male  107008
34  AssocProf          B   12        8    Male  119800
38   AsstProf          B    4        3    Male   91000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000
46   AsstProf          B   11        3  Female   74692
47  AssocProf          B   11       11  Female  103613
50   AsstProf          B   10        5  Female   97032
53   AsstProf          A    5        3  Female   73500
54  AssocProf          A   25       22  Female   62884
55   AsstProf          A    2        0  Female   72500
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
64  AssocProf          A   26       24  Female   73300
66   AsstProf          A    7        6  Female   63100
68   AsstProf          A    4        2  Female   77500
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
74  AssocProf          B   19        6  Female  104542

In [ ]:
df[((df['rank']=='AssocProf') | (df['rank']=='Prof')) & 
   ((df['discipline']=='A') | (df['discipline']=='B'))]

In [ ]:
df[(df['rank']=='Prof') & ((df['salary'] >=100000) & (df['salary']<=150000))]

In [ ]:
df[((df['rank']=='AssocProf') | (df['rank']=='Prof')) & (df['discipline']=='A')]

In [ ]:
df[(df['rank']=='Prof') & (df['sex']=='Male') & (df['salary']>=100000)]

In [ ]:
df[((df['phd']>30) & (df['phd']<50)) & 
   ((df['salary']>=70000) & (df['salary']<=100000))]

In [ ]:
df[(df['rank']=='Prof') & (df['discipline']=='A') & (df['sex']=='Female') & 
   ((df['service']>=15) & ((df['service']<=20)))]

In [ ]:
df[((df['rank']=='AssocProf') | (df['rank']=='Prof')) & 
   (df['discipline']=='A')].sort_values(by=['phd'],axis=0)

In [ ]:
len(df[df['rank']=='AssocProf'])

In [ ]:
len(df[(df['rank']=='AssocProf') & (df['discipline']=='A')])

In [ ]:
df[(df['rank']=='AssocProf') & ((df['discipline']=='B') | (df['discipline']=='A'))]

In [ ]:
df[(df['salary']>=50000) & (df['salary']<=100000)]

In [ ]:
df[(df['rank']=='AssocProf') & (df['salary']>=50000) & (df['salary']<=100000)]

In [ ]:
#To get the average of 'salary' & 'PhD' variables grouped by the values of 'rank' variable
df.groupby('rank')[['salary','phd']].mean()

In [ ]:
df.groupby('rank')['salary'].max()

In [ ]:
df['rank']=='AsstProf'

In [ ]:
df[df['rank']=='AsstProf']

In [ ]:
AsstProf=df[df['rank']=='AsstProf']
AsstProf

In [ ]:
AsstProf['salary'].max()

In [ ]:
print('The maximum salary of AsstProf is Rs.',df[df['rank']=='AsstProf']['salary'].max())

In [ ]:
print('The minimum years of service for Prof is ',df[df['rank']=='Prof']['service'].min())

In [ ]:
df[df['discipline']=='A']['salary'].max()

In [ ]:
grouped=df.groupby('rank')
grouped

In [ ]:
type(grouped)

In [ ]:
#To filter the rows of the salary column. 
#The rows with salary greater than 150000 will be displayed
df.salary>=150000

In [ ]:
df[df.salary>=150000]

In [ ]:
df['salary']

df.salary

In [ ]:
df[(df.phd==20) | (df.phd==40)]

In [ ]:
df[(df.phd==20) & (df['rank']=='Prof')]

In [ ]:
df[(df['discipline']=='A') | (df['rank']=='Prof')]

In [ ]:
df[(df['rank'] =='AsstProf') | (df['rank'] =='AssocProf')]

In [ ]:
#Extract the rows with salary greater than or equal to 50000 & lesser than 100000, for AsstProfs & Profs.

#Display the rows having salary greater than 75000, discipline as A, for AssocProfs & Profs.

In [ ]:
df[((df.salary>=50000) & (df.salary<100000)) & ((df['rank']=='Prof') | (df['rank']=='AsstProf'))]

In [ ]:
df[(df.salary>75000) & (df.discipline == 'A') & ((df['rank']=='AssocProf') | (df['rank']=='Prof'))]

In [ ]:
df[(df['rank'] =='AsstProf') | (df['rank'] =='AssocProf')].sort_values(by=['rank'],axis=0)

In [ ]:
df[((df['rank'] =='AsstProf') | (df['rank'] =='AssocProf')) & (df.phd==20)]

In [ ]:
df[((df['rank'] =='AsstProf') | (df['rank'] =='AssocProf')) & ((df.phd==20) | (df.phd==7))]

In [ ]:
#The function below displays rows 1 to 3 & columns from index 0 to index 2
df.iloc[1:4+1, 0:3]

In [ ]:
df

In [ ]:
df.iloc[[1,2,3,4],[0,1,2,3]]

In [ ]:
df.iloc[[1,2,3,4],0:3]

In [ ]:
#The function below displays rows 25 to 44 & all columns 
df.iloc[25:45,:]

In [ ]:
df.iloc[35:76,1:4]

In [ ]:
#To display all the rows from the 3rd column 'sex'
df.iloc[:,4]

In [ ]:
df.loc[[1,2,3,4],['discipline','salary']]

In [ ]:
import pandas as pd

In [ ]:
shoplist=pd.DataFrame()
shoplist

In [ ]:
shoplist=pd.DataFrame(columns = ['Fruits','Vegetables','Snacks','Dairy'])
shoplist

In [ ]:
A= ['Apple' , 'Banana' , 'Grapes' ]
B= ['Tomato' , 'Potato' , 'Cucumber']
C= ['Chips' , 'Chocolate' , 'Biscuit']
D= ['Paneer' , 'Milk' , 'Yoghurt']

In [ ]:
shoplist['Fruits'] =pd.Series(A)
shoplist['Vegetables'] =pd.Series(B)
shoplist['Snacks'] =pd.Series(C)
shoplist['Dairy'] =pd.Series(D)
shoplist

In [ ]:
shoplist['Index']=['A','B','C']
shoplist

In [ ]:
shoplist.set_index('Index', inplace=True)
shoplist

In [ ]:
shoplist['Desert'] = ['Milkshake','Ice-cream','Cold-coffee']
shoplist

In [ ]:
shoplist.loc[['A','C'],['Vegetables','Dairy']]

In [ ]:
shoplist.iloc[[0,2],[1,3]]

In [ ]:
Grains=pd.Series(['Rice','Wheat','Sugar'],index=['A','B','C'])
shoplist['Grains']=Grains

In [ ]:
shoplist

In [ ]:
shoplist['Juice']=pd.Series(['Orange','Cranberry','Apple'],index=['A','B','C'])
shoplist

In [ ]:
#To display 'shoplist' dataframe without 'Dairy' column. It will only hide the column, not delete it.
shoplist.drop('Dairy',axis=1)

In [ ]:
shoplist

In [ ]:
#To modify the dataframe 'shoplist' by deleting the 'Dairy' column
shoplist.drop('Dairy',axis=1,inplace=True)
shoplist

In [ ]:
type(shoplist['Fruits'])

In [ ]:
type(shoplist)

In [ ]:
shoplist

In [ ]:
#Create empty data frame
df = pd.DataFrame(columns=['Name','City','Language','Interest'])

print(df)

#creating lists
name = ['Rushabh','Ankit','Jimmy']
city = ['Banglore','Mumbai','Pune']
language = ['Python','C','C++']
interest = ['Machine Learning','Deep Learning','Data Science']

#Convert the list to pandas series
first_column = pd.Series(name)
second_column = pd.Series(city)
third_column = pd.Series(language)
fourth_column = pd.Series(interest)

#Insert the series into data frame
df['Name'] = first_column
df['City'] = second_column
df['Language'] = third_column
df['Interest'] = fourth_column

df

In [ ]:
pd.

In [ ]:
import os

In [ ]:
#To check the current working directory
os.getcwd()

In [ ]:
#To change the current working directory
os.chdir('D:\\ALL DATA SCIENCE\\Learn Digital\\DataSets')

In [ ]:
import pandas as pd
iris=pd.read_csv('iris.csv')

In [ ]:
iris

In [ ]:
#Create a Pandas Series
s=pd.Series(5,index=[1,2,3,4])
s

In [ ]:
s=pd.Series(['A','B','C','D'],index=[1,2,3,4])
s

In [ ]:
x=pd.Series([1,2,3],index=['a','b','c'])
x

In [ ]:
x=pd.Series([1,2,3],index=['a','b','c','d'])
x

In [ ]:
x.index

In [ ]:
x.values

In [ ]:
a=pd.Series([1,2,5,6,7,8,9])
a

In [ ]:
a.ndim

In [ ]:
a.size

In [ ]:
import numpy as np
a=pd.Series([1,2,5,6,7,np.NaN,9])
a.count

In [ ]:
a.empty

In [ ]:
a.hasnans

In [ ]:
a=pd.Series(['Java','C','C++',np.nan])
a

In [ ]:
b=a.map({'Java':'Core','C':'C++','C++':'Python'})
#a.map({'Java':'Core'})
print(a)
print(b)

In [ ]:
a.map('I like {}'.format,na_action='ignore')

In [ ]:
b.map('I like {}'.format,na_action='ignore')

In [ ]:
c=pd.Series(['Apple','Banana','Guava','Pineapple'])
print(c)
c.map('I like {}'.format,na_action='ignore')

In [ ]:
a=pd.Series([1,4,5,8,7,9], name="vals")
print(a)
a.to_frame()

In [ ]:
x

In [ ]:
x['b']

In [ ]:
emp=['Parker','John','David','Smith']
id_nos=[102,120,156,147]
emp_series=pd.Series(emp)
print(emp_series)
id_nos_series=pd.Series(id_nos)
print(id_nos_series)

In [ ]:
frame={'Emp':emp_series,'Id_Nos':id_nos_series}
result=pd.DataFrame(frame)
result

In [ ]:
a=pd.Series([1,1,7,4,5,7,4,2,6,4,9])
pd.unique(a)

In [ ]:
a.value_counts()

In [ ]:
import pandas as pd
info={'Name':['Parker','Smith','John','William'],
     'Sub1_Marks':[52,38,42,37],
     'Sub2_Marks':[41,35,78,56]}
data=pd.DataFrame(info)
data

In [ ]:
data.std()

In [ ]:
data.sum()

In [ ]:
data.mean()

In [ ]:
data.count()

In [ ]:
print(data)
data.cumsum()

In [ ]:
df=pd.DataFrame()
print(df)

In [ ]:
data=[['Alex',10],['Bob',12],['Clarke',13]]
data

In [ ]:
df=pd.DataFrame(data,columns=['Name','Marks'])
df

In [ ]:
info={'one':pd.Series([1,2,3,4,5,6,7], index=['a','b','c','d','e','f','g']),
    'two':pd.Series([1,2,3,4], index=['a','b','d','g']),
     'three':pd.Series([5,7,8], index=['b','d','f'])}
df=pd.DataFrame(info)
df

In [ ]:
df['three']=pd.Series([5,7,6,5,2,3], index=['a','b','c','d','e','f'], dtype='int64')
df

In [ ]:
del df['two']
df

In [ ]:
df.pop('three')

In [ ]:
import pandas as pd
df1=pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df2=pd.DataFrame([[5,6],[8,9]],columns=['a','b'])
print(df1)
print(df2)

In [ ]:
df=df1.append(df2)
df

In [ ]:
df.columns=['Col_1','Col_2']
df

In [ ]:
df.index=['A','B','C','D']
df

In [ ]:
df=df.rename(columns={"Col_1":"Col1","Col_2":"Col2"})
df

In [ ]:
df=df.rename(columns=lambda x:x+'_dummy')
df

df.columns.values[0]='Col_1'
df

df.columns.values[1]='Col_2'
df

In [ ]:
df.index=[1,2,3,4]
df

In [ ]:
df=df.rename(index=lambda x:x+10)
df

In [ ]:
df=df.drop(12)
df

In [ ]:
info=pd.DataFrame([[2,7]]*4,columns=['A','B'])
info

In [ ]:
info=pd.DataFrame([[9620100789,9620100789]]*4,columns=['A','B'])
info

In [ ]:
info=pd.DataFrame([[9,6,2,0,1,0,0,7,8,9]]*4,columns=['A','B','C','D','E','F','G','H','I','J'])
info

In [ ]:
import numpy as np
info.apply(np.sqrt)

In [ ]:
info.apply(np.sum,axis=0)

In [ ]:
info={'one':pd.Series([1,2,3,4,5,6,7], index=['a','b','c','d','e','f','g']),
    'two':pd.Series([1,2,3,4], index=['a','b','c','d'])}
df=pd.DataFrame(info)
df['three']=pd.Series([5,7,6,5,2,3], index=['a','b','c','d','e','f'])
df


print(df)
df.agg(['sum','max','min','mean','std'])

In [ ]:
df=df.assign(four=[5,6,7,8,9,7,4])

In [ ]:
df.apply(np.sum,axis=0)

In [ ]:
df

In [ ]:
df.apply(np.sum,axis=1)

In [ ]:
Data_frame.dtypes

In [ ]:
Data_frame=Data_frame['price'].astype('int32').dtypes

In [ ]:
import numpy as np
print(np.random.randint(1,50,15))
age=np.random.randint(0,120,50)
age

# Binning/Categorization/Discretization

In [ ]:
import numpy as np
import pandas as pd
info_nums=pd.DataFrame({'age':np.random.randint(0,120,50)})
info_nums

In [ ]:
info_nums['age_bins']=pd.cut(x=info_nums['age'],bins=[0,20,40,60,80,100,120],
                             labels=['0-20','20-40','40-60','60-80','80-100','100-120'],include_lowest=True)
info_nums

info_nums['age_labels']=pd.cut(x=info_nums['age'],bins=[0,20,40,60,80,100,120],
                             labels=['A','B','C','D','E','F'],include_lowest=True)
info_nums

In [ ]:
info_nums['age_bins_default']=pd.cut(x=info_nums['age'],bins=[0,20,40,60,80,100,120],
                                     include_lowest=True,right=False)
info_nums

In [ ]:
info_nums['age_bins'].value_counts()

In [ ]:
info_nums['age_bins']=pd.cut(x=info_nums['age'],bins=[1,15,25,35,50],
                             labels=['Adolescents','Young','Working','Middle-Aged'])
info_nums

In [ ]:
info_nums['age_bins']=pd.cut(x=info_nums['age'],bins=[1,15,25,35,50],
                             labels=['Kids','Adolescents','Teenagers','Working'])
info_nums

In [ ]:
info_nums['age_bins']=pd.cut(x=info_nums['age'],bins=[1,15,25,35,50])
info_nums

In [ ]:
info = pd.DataFrame({'categorical': pd.Categorical(['s','t','s','s','r','t']),  
'numeric': [1,2,3,7,3,1],  
'object': pd.Categorical(['p', 'q', 'r','p', 'q', 'r'])  
 })
info

In [ ]:
info.dtypes

In [ ]:
emp = {"Name": ["Parker", "Smith", "William", "Parker","Smith","Parker"],  
"Age": [21, 32, 29, 21,32,28]}  
info = pd.DataFrame(emp)  
info

In [ ]:
info1=info.drop_duplicates()
info1

In [ ]:
shop = {"Product": ["Eraser", "Eraser", "Pen", "Pencil","Ruler","Pen", "Pencil","Ruler","Ruler", "Eraser"],  
"Price": [15,20,50,30,30,25,25,15,20,15]}  
info = pd.DataFrame(shop)  
info

In [ ]:
#Aggregated Functions - Applied on a group of numerical values
print(info.groupby('Product').agg(np.mean))
print(info.groupby('Product').agg(np.sum))
print(info.groupby('Product').agg(np.max))
print(info.groupby('Product').agg(np.min))
print(info.groupby('Product').agg(np.median))
print(info.groupby('Product').agg(np.var))
print(info.groupby('Product').agg(np.std))

In [ ]:
employee=pd.read_csv('D:\\ALL DATA SCIENCE\\Learn Digital\\DataSets\\employee.csv')

In [ ]:
employee

In [ ]:
employee.dtypes

In [ ]:
employee.describe(include='object')

In [ ]:
employee.describe(include='int64')

In [ ]:
employee.dtypes=="object"

In [ ]:
employee.dtypes[employee.dtypes=='object'].index

In [ ]:
List_Indices=list(employee.dtypes[employee.dtypes=='object'].index)
List_Indices

In [ ]:
#NEVER EVER DO THIS... It will change/distort the data. 
#Because only & only the age column will get sorted, but not the corresponding other data.

# employee['Age']=sorted(employee['Age'])

In [ ]:
employee

In [ ]:
sorted(employee['Department'])

In [ ]:
employee['BusinessTravel'].dtype

In [ ]:
BusinessTravel_New=employee['BusinessTravel'].astype(str)
BusinessTravel_New

In [ ]:
Attrition_New=employee['Attrition'].astype(str)
print(Attrition_New.dtype)
print(Attrition_New)
[i[0] for i in Attrition_New]

In [ ]:
import pandas as pd
Titanic=pd.read_csv("D:\\ALL DATA SCIENCE\\ExcelR\\Datasets\\titanic.csv")
Titanic

In [ ]:
Titanic.isnull().sum()

In [ ]:
#Find the percentage of rows that have value 'S' in column 'embarked'
(len(Titanic[Titanic['embarked']=='S'])/len(Titanic))*100

In [ ]:
#Find the average fare, grouped by pclass & embarked 
Titanic.groupby(['pclass','embarked'])['fare'].mean()

In [ ]:
#Sort the data based on the 'age' column
Titanic.sort_values('age')

In [ ]:
#Find the average age grouped by gender
Titanic.groupby('sex')['age'].mean()

In [ ]:
#Find the rows having embarked value as 'S' & 'Q' & with age being greater than 25 
Titanic[((Titanic['embarked']=='S') | (Titanic['embarked']== 'Q')) & (Titanic['age'] > 25)]

In [ ]:
'''Given that 'Sibsp' is no. of siblings & spouse accompanied on the ship & 
'parch' is no. of parents & children accompanied,
find the percentage of passengers travelling alone on the ship.'''
(len(Titanic[(Titanic['sibsp']==0) & (Titanic['parch']==0)])/len(Titanic))*100

In [ ]:
'''Name the passenger/s having the largest family onboard'''
(Titanic['sibsp'] + Titanic['parch']).max()

In [ ]:
Titanic['Family_Size']=Titanic['sibsp'] + Titanic['parch']
Titanic

In [ ]:
Titanic[Titanic['Family_Size']==10]

In [ ]:
missing=np.where(Titanic['age'].isnull()==True)
missing

In [ ]:
df_col=df.columns
df_unique=[]
for i in df_col:
    df_unique.append(list(df[i].unique()))
    
for i in df_unique:
    i.sort(reverse=False)
    
df_unique

In [ ]:
df_unique=[list(df['rank'].unique()),list(df['discipline'].unique()),
           list(df['phd'].unique()),list(df['service'].unique()),
           list(df['sex'].unique()),list(df['salary'].unique())]
df_unique

for i in df_unique:
    i.sort()
    
df_unique

In [ ]:
import pandas as pd
#Importing the data on the web in a csv file into a dataframe in Anaconda environment
df = pd.read_csv("https://raw.githubusercontent.com/Apress/data-analysis-and-visualization-using-python/master/Ch07/Salaries.csv")
df.head()

Using the above dataset, create a column, which has the unique values of all the columns from the dataset, & the column next to that, should have the frequency counts of those unique values.

Output should be as shown below:

Prof                 56
AssocProf            23 
Asst Prof            59
A                    56   
B                    ..
1                    ..
2
3..
..
..
..
unique values of all other columns

Write a loop for the above.

Please tell me if you have any doubts as of now. Will finish the session after doubt clearing.

In [ ]:
df1=pd.DataFrame()
l=[]
for i in list(df[col].unique() for col in df):
    for j in i:
        l.append(j)
l1=list(df[i].value_counts() for i in df)
l2=[]
df1=pd.DataFrame()
l=[]
for i in list(df[col].unique() for col in df):
    for j in i:
        l.append(j)
l1=[]
for i in list(df[i].value_counts() for i in df):
    for j in i:
        l1.append(j)
df1['ukeys']=pd.Series(l)
df1['vc']=pd.Series(l1)
df1

In [ ]:
Student_data=pd.DataFrame(columns=['Name','Last Name','DOB','Percentage','Grade'])
Student_data

A=['Nikita','Ankush','Ayansh','Shruti','Swarit']
B=['Sankhe','Patil','Pimple','Mhatre','Salunkhe','Deshpande']
C=['3/9/1989','8/4/1989','27/7/1990','11/11/1991','2/6/1991']
D=['85%','96%','75%','64%','50%']
E=['A','A','B','B','C']

Student_data['Name']=pd.Series(A)
Student_data['Last Name']=pd.Series(B)
Student_data['DOB']=pd.Series(C)
Student_data['Percentage']=pd.Series(D)
Student_data['Grade']=pd.Series(E)
Student_data